//Завдання 1
// let admin;
// let name;
// name = 'Volodymyr';
// admin = name;
// alert(admin);


//Завдання 2
// const birthday = '18.04.1982';
// const age = someCode(birthday);

// const BIRTHDAY = '18.04.1982'; // Можна використовувати великі літери, оскільки дата народження незмінна та відома до початку виконання скрипта
// const AGE = someCode(BIRTHDAY); // Не можна використовувати великі літери, оскільки вік зміннний та вираховується під час виконання скрипта


//Завдання 3
// let name = "Ilya " ;
// alert ( ` hello ${ 1 } ` ); //Виведе строку " hello 1 ", якщо не враховувати синтаксичну помилку в наступній інструкції
// alert ( ` hello ${ "name " } ); //Буде синтаксична помилка, оскільки загублено закриваючу зворотну лапку строки-аргумента alert()
// //Якщо виправити синтаксичну помилку, то виведе строку " hello name  "
// alert ( ` hello ${ name } ` ); //Виведе строку " hello Ilya  ", якщо не враховувати синтаксичну помилку в попередній інструкції


//Завдання 4
// "" + 1 + 0 //Виведе "10" (string)
// "" - 1 + 0 //Виведе -1 (number)
// true + false //Виведе 1 (number)
// 6 / "3" //Виведе 2 (number)
// "2" * "3" //Виведе 6 (number)
// 4 + 5 + "px" //Виведе "9px" (string)
// "$" + 4 + 5 //Виведе "$45" (string)
// "4" - 2 //Виведе 2 (number)
// "4px" - 2 //Виведе NaN
// 7 / 0 //Виведе Infinity
// " – 9 " + 5 //Виведе " – 9 5" (string)
// " – 9 " - 5 //Виведе NaN, бо в " – 9 " використано не знак мінуса і є пробіл між знаком і числом 9
// null + 1 //Виведе 1 (number)
// undefined + 1 //Виведе NaN


//Завдання 5
// let a = 1, b = 1;
// let c = ++a; // a = 2, c = 2
// let d = b++; // b = 2, d = 1


//Завдання 6
// let a = 2;
// let x = 1 + (a *= 2 ); //a = 4, x = 5


//Завдання 7
// 5 > 4 //true, звичайне порівняння чисел
// "ананас" > "яблуко" //false, порівняння строк посимвольно, де "я" більше за "а"
// "2" > "12" //true, порівняння строк посимвольно, де "2" більше за "1"
// undefined == null //true, бо undefined та null хибні, а false == false це true
// undefined === null //false, бо суворе порівняння різних типів даних
// null == "\n0\n" //false, бо null хибне, "\n0\n" - істинне, а false == true - це false
// null === +"\n0\n " //false, бо суворе порівняння різних типів даних


//Завдання 8
// let userName = prompt('Уведіть ваше ім\'я');
// alert(`Ваше ім'я: ${userName}`);


//Завдання 9
// if ("0") {
//     alert( ' Привіт');
//    } //Так, бо "0" => true, істинне значення, а отже умова виконається 


//Завдання 10
// let userResponse = prompt('Яка «офіційна» назва JavaScript ?');
// if (userResponse == 'ECMAScript') {
//     alert('Правильно!');
// } else {
//     alert('Не знаєте? ECMAScript!');
// }


//Завдання 11
// let userResponse = +prompt('Уведіть число');
// if (userResponse > 0) {
//     alert(1);
// } else if(userResponse < 0) {
//     alert(-1);
// } else {
//     alert(0);
// }


//Завдання 12
// let a = 2; //для перевірки
// let b = 3; //для перевірки

// let result;
// (a + b < 4) ? result = ' Мало ' : result = 'Багато';


//Завдання 13
// let login = 'Співробітник'; //для перевірки
// let message;

// (login == 'Співробітник') ?
// message = 'Привіт' : 
//     (login == 'Директор') ?
//     message = 'Добрий день!' : 
//         (login == '') ?
//         message = 'Відсутній логін' : message = '';


//Завдання 14
// alert( null || 2 || undefined ); //Виведе 2, бо це перше істинне значення, яке поверне оператор АБО; відповідь - 2


//Завдання 15
// alert(alert (1) || 2 || alert(3)); /* Виведе спочатку 1 (перша внутрішня функція alert), яка поверне undefined, 
// а потім виведе 2 (зовнішня функція alert), тому що 2 - перше істинне значення, яке поверне оператор АБО; відповідь - 1, потім 2 */


//Завдання 16
// alert(1 && null && 2); //Виведе значення null, оскільки оператор І поверне перше хибне значення, тобто null; відповідь - null


//Завдання 17
// alert(alert(1) && alert(2)); /*Спочатку виведе 1, бо спрацює перша внутрішня функція alert(1), яка поверне undefined, потім спрацює зовнішня
// функція alert, яка виведе undefined - перше хибне значення, повернене оператором І. Другий внутрішня функція alert(2) не спрацює; відповідь - 1, потім undefined*/


//Завдання 18
// alert(null || 2 && 3 || 4 ); //Спочатку спрацює оператор І у виразі 2 && 3, який поверне 3 (останнє значення, оскільки обидва значення істинні)
// //Далі перший оператор АБО у виразі null || 3 поверне 3 як перше істинне значення, яке і виведе зовнішня функція alert(); відповідь - 3


//Завдання 19
// let age = 13; //для перевірки
// if (age >= 14 && age <= 90) {
//     alert(`Значення змінної age = ${age} входить в діапазон значень між 14 та 90 включно`);
// } else {
//     alert(`Значення змінної age = ${age} НЕ входить в діапазон значень між 14 та 90 включно`);
// }


//Завдання 20
//З використанням НЕ
// let age = 18; //для перевірки
// if (!(age >= 14 && age <= 90)) {
//     alert(`Значення змінної age = ${age} НЕ входить в діапазон значень між 14 та 90 включно`);
// } else {
//     alert(`Значення змінної age = ${age} входить в діапазон значень між 14 та 90 включно`);
// }

//Без використання НЕ
// let age = 18; //для перевірки
// if (age < 14 || age > 90) {
//     alert(`Значення змінної age = ${age} НЕ входить в діапазон значень між 14 та 90 включно`);
// } else {
//     alert(`Значення змінної age = ${age} входить в діапазон значень між 14 та 90 включно`);
// }


//Завдання 21
// if (-1 || 0) alert('first'); //результатом виразу в if(...) буде значення -1, тобто if(-1); alert виконається, адже -1 - true (істинне)
// if (-1 && 0) alert('second'); //результатом виразу в if(...) буде значення 0, тобто if(0); alert не виконається, адже 0 - false (хибне)
// if (null || -1 && 1) alert('third'); //результатом виразу в if(...) буде значення 1, тобто if(1); alert виконається, адже 1 - true (істинне)


//Завдання 22
// let userLogin = prompt('Уведіть свій логін:');
// if (userLogin == 'Адмін') {
//     let userPassword = prompt('Уведіть свій пароль:');
//     if (userPassword == 'я головний') {
//         alert('Здрастуйте!');
//     }  else if (userPassword == null) {
//         alert('Скасовано');
//     } else {
//         alert('Невірний пароль');
//     }
// } else if (userLogin == null || userLogin == '') {
//     alert('Скасовано');
// } else {
//     alert('Я вас не знаю');
// }


//Завдання 23
// let browser = 'Safari';
// if (browser == 'Edge') {
//     alert('You\'ve got the Edge!');
// } else if (browser == 'Chrome' || browser == 'Firefox' || browser == 'Safari' || browser == 'Opera') {
//     alert('Okay we support these browsers too');
// } else {
//     alert('We hope that this page looks ok!'); 
// }


//Завдання 24
// let a = +prompt('a?', '');
// switch(a) {
//     case 0:
//         alert(0);
//         break;
//     case 1:
//         alert(1);
//         break;
//     case 2:
//     case 3:
//         alert('2,3');
//         break;
// }


//Завдання 25
// let a = 22;
// if (a > 0) {
//     alert(++a);
// } else {
//     alert(a);
// }


//Завдання 26
// let a = -21;
// if (a > 0) {
//     alert(++a);
// } else {
//     alert(a -= 2);
// }


//Завдання 27
// let a = 0;
// if (a > 0) {
//     alert(++a);
// } else if (a < 0) {
//     alert(a -= 2);
// } else if (a === 0) {
//     alert(a = 10);
// }


//Завдання 28
// let a = 2;
// let b = -4;
// let c = 0;
// if (a > 0  && b > 0 && c > 0) {
//     alert('Кількість позитивних чисел - 3');
// } else if(a > 0 && b > 0 || a > 0 && c > 0 || b > 0 && c > 0) {
//     alert('Кількість позитивних чисел - 2');
// } else if (a > 0 || b > 0 || c > 0) {
//     alert('Кількість позитивних чисел - 1');
// } else {
//     alert('Кількість позитивних чисел - 0');
// }


//Завдання 29
// let a = 2;
// let b = -3;
// let c = 0;
// if (a > 0 && b > 0 && c > 0) {
//     alert('Кількість позитивних чисел - 3');
//     alert('Кількість негативних чисел - 0');
// } else if (a > 0 && b > 0 && c <= 0 || a > 0 && b <= 0 && c > 0 || a <= 0 && b > 0 && c > 0) {
//     alert('Кількість позитивних чисел - 2');
//     if (a != 0 && b != 0 && c != 0) {
//         alert('Кількість негативних чисел - 1');
//     } else {
//         alert('Кількість негативних чисел - 0');
//     }
// } else if (a >= 0 && b < 0 && c < 0 || a < 0 && b >= 0 && c < 0 || a < 0 && b < 0 && c >= 0) {
//     if(a != 0 && b != 0 && c != 0) {
//         alert('Кількість позитивних чисел - 1');
//     } else {
//         alert('Кількість позитивних чисел - 0');
//     }
//     alert('Кількість негативних чисел - 2');
// } else if (a < 0 && b < 0 && c < 0) {
//     alert('Кількість позитивних чисел - 0');
//     alert('Кількість негативних чисел - 3');
// } else if (a == 0 && b == 0 && c == 0) {
//     alert('Кількість позитивних чисел - 0');
//     alert('Кількість негативних чисел - 0');
// } else if (a == 0 && b == 0 || a == 0 && c == 0 || c == 0 && b == 0) {
//     if (a > 0 || b > 0 || c > 0) {
//         alert('Кількість позитивних чисел - 1');
//         alert('Кількість негативних чисел - 0');
//     } else {
//         alert('Кількість позитивних чисел - 0');
//         alert('Кількість негативних чисел - 1');
//     }
// } else if (a == 0 && b != 0 && c != 0 || a != 0 && b == 0 && c != 0 || a != 0 && b != 0 && c == 0) {
//     if (a > 0 && c > 0 || a > 0 && b > 0 || c > 0 && b > 0) {
//         alert('Кількість позитивних чисел - 2');
//         alert('Кількість негативних чисел - 0');
//     } else if (a < 0 && c < 0 || a < 0 && b < 0 || c < 0 && b < 0) {
//         alert('Кількість позитивних чисел - 0');
//         alert('Кількість негативних чисел - 2');
//     } else {
//         alert('Кількість позитивних чисел - 1');
//         alert('Кількість негативних чисел - 1');
//     }
// }


//Завдання 30
// let a = 1;
// let b = 3;
// if (a !== b) {
//     (a > b) ? alert(a) : alert(b); 
// } else if (a === b) {
//     alert('Числа рівні!')
// }


//Завдання 31
// let a = 1;
// let b = 3;
// if (a !== b) {
//     (a < b) ? alert(a) : alert(b);
// } else if (a === b) {
//     alert('Числа рівні!')
// }


//Завдання 32
// let a = 1;
// let b = 3;
// if (a !== b) {
//     (a > b) ? (alert(a), alert(b)) : (alert(b), alert(a));
// } else if (a === b) {
//     alert('Числа рівні!')
// }


//Завдання 33
// let A = 18;
// let B = -22;
// if (A > B) {
//     let temp = A;
//     alert(`Значення A: ${A = B}`);
//     alert(`Значення B: ${B = temp}`);
// } else if (B > A) {
//     alert(`Значення A: ${A}`);
//     alert(`Значення B: ${B}`);
// } else if (A == B) { //якщо значення рівні, то переносимо одиницю з А до B
//     alert(`Значення A: ${--A}`);
//     alert(`Значення B: ${++B}`);
// }


//Завдання 34
// let A = 18;
// let B = -22;
// if (A !== B) {
//     A = B = A + B;
//     alert(`Значення A: ${A}`);
//     alert(`Значення B: ${B}`);
// } else if (A === B) {
//     alert(`Значення A: ${A = 0}`);
//     alert(`Значення B: ${B = 0}`);
// }


//Завдання 35
// let A = 18;
// let B = -22;
// if (A !== B) {
//     A = B = (A > B) ? A : B;
//     alert(`Значення A: ${A}`);
//     alert(`Значення B: ${B}`);
// } else if (A === B) {
//     alert(`Значення A: ${A = 0}`);
//     alert(`Значення B: ${B = 0}`);
// }


//Завдання 36
// let a = 12;
// let b = 0;
// let c = -7;
// if (a < b && a < c) {
//     alert(`Найменше число a: ${a}`);
// } else if (b < a && b < c) {
//     alert(`Найменше число b: ${b}`);
// } else if (c < a && c < b) {
//     alert(`Найменше число c: ${c}`);
// } else {
//     if (a == b && a == c) {
//         alert('Всі числа рівні!');
//     } else if (a == b) {
//         if (c > a) {
//             alert(`Найменші числа a = ${a} та b = ${b}`);
//         } else {
//             alert(`Найменше число c: ${c}`);
//         }
//     } else if (a == c) {
//         if (b > a) {
//             alert(`Найменші числа a = ${a} та c = ${c}`);
//         } else {
//             alert(`Найменше число c: ${b}`);
//         }
//     } else if (b == c) {
//         if (a > b) {
//             alert(`Найменші числа b = ${b} та c = ${c}`);
//         } else {
//             alert(`Найменше число a: ${a}`);
//         }
//     }
// }


//Завдання 37
// let a = 12;
// let b = 0;
// let c = -7;
// if (a > b && a < c || a < b && a > c) {
//     alert(`Середнє число a: ${a}`);
// } else if (b > a && b < c || b < a && b > c) {
//     alert(`Середнє число b: ${b}`);
// } else if (c > a && c < b || c < a && c > b) {
//     alert(`Середнє число c: ${c}`);
// } else {
//     alert('Середнє число визначити неможливо!');
// }


//Завдання 38
// let a = 12;
// let b = 0;
// let c = -7;
// if (a < b && a < c && b != c) {
//     alert(`Найменше число a: ${a}`);
//     (b < c) ? alert(`Найбільше число c: ${c}`) : alert(`Найбільше число b: ${b}`);
// } else if (b < a && b < c && a != c) {
//     alert(`Найменше число b: ${b}`);
//     (a < c) ? alert(`Найбільше число c: ${c}`) : alert(`Найбільше число a: ${a}`);
// } else if (c < a && c < b && a != b) {
//     alert(`Найменше число c: ${c}`);
//     (a < b) ? alert(`Найбільше число b: ${b}`) : alert(`Найбільше число a: ${a}`);
// } else if (a == b && a == c) {
//     alert('Всі числа однакові!');
// } else if (a == b && a > c) {
//     alert(`Найменше число c: ${c}`);
//     alert(`Найбільші числа a = ${a} та b = ${b}`);
// } else if (a == b && a < c) {
//     alert(`Найменші числа a = ${a} та b = ${b}`);
//     alert(`Найбільше число c = ${c}`);
// } else if (a == c && a > b) {
//     alert(`Найменше число b: ${b}`);
//     alert(`Найбільші числа a = ${a} та c = ${c}`);
// } else if (a == c && a < b) {
//     alert(`Найменші числа a = ${a} та c = ${c}`);
//     alert(`Найбільше число b = ${b}`);
// } else if (b == c && b > a) {
//     alert(`Найменше число a: ${a}`);
//     alert(`Найбільші числа b = ${b} та c = ${c}`);
// } else if (b == c && b < a) {
//     alert(`Найменші числа b = ${b} та c = ${c}`);
//     alert(`Найбільше число a = ${a}`);
// }


//Завдання 39
// let a = 12;
// let b = 3;
// let c = -7;
// if (a > b && a > c && b != c) {
//     alert(`Сума найбільших чисел: ${(b > c) ? b + a : c + a}`);
// } else if (b > a && b > c && a != c) {
//     alert(`Сума найбільших чисел: ${(a > c) ? a + b : c + b}`);
// } else if (c > a && c > b && a != b) {
//     alert(`Сума найбільших чисел: ${(a > b) ? a + c : b + c}`);
// } else if (a == b && a > c) {
//     alert(`Сума найбільших чисел: ${a + b}`);
// } else if (a == c && a > b) {
//     alert(`Сума найбільших чисел: ${a + c}`);
// } else if (b == c && b > a) {
//     alert(`Сума найбільших чисел: ${b + c}`);
// } else {
//     alert('Неможливо визначити два найбільших числа!');
// }


//Завдання 40
// let a = 12;
// let b = 3;
// let c = 12;
// if (a == b && a != c) {
//     alert(`Число, відмінне від інших с: ${c}`);
// } else if (a == c  && a != b) {
//     alert(`Число, відмінне від інших b: ${b}`);
// } else if (c == b  && c != a) {
//     alert(`Число, відмінне від інших a: ${a}`);
// } else if (a == b && a == c) {
//     alert('Всі числа однакові!');
// } else if (a != b && a != c && b != c) {
//     alert('Всі числа різні!');
// }